In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
data = np.array([1,2,3,4,5,6,7,8,9,10])
series = pd.Series(data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 
                                'h', 'i', 'j'])

In [7]:
series[0:5]

a    1
b    2
c    3
d    4
e    5
dtype: int32

# Dataframes

In [13]:
data = {
    "id" : [101,102,103,104,105,106,107,108,109,110],
    "movie_name" : ['Bahubali', 'Chappie', 'Judwa', 'Golmaal', 'Fukrey',
                    'Robot','Rocky','Ra.One','Anaconda','ABCD']
}

df = pd.DataFrame(data)

In [14]:
df

    id movie_name
0  101   Bahubali
1  102    Chappie
2  103      Judwa
3  104    Golmaal
4  105     Fukrey
5  106      Robot
6  107      Rocky
7  108     Ra.One
8  109   Anaconda
9  110       ABCD

In [15]:
df['id']

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: id, dtype: int64

In [16]:
df['movie_name']

0    Bahubali
1     Chappie
2       Judwa
3     Golmaal
4      Fukrey
5       Robot
6       Rocky
7      Ra.One
8    Anaconda
9        ABCD
Name: movie_name, dtype: object

In [17]:
df.head()

    id movie_name
0  101   Bahubali
1  102    Chappie
2  103      Judwa
3  104    Golmaal
4  105     Fukrey

In [18]:
df.tail()

    id movie_name
5  106      Robot
6  107      Rocky
7  108     Ra.One
8  109   Anaconda
9  110       ABCD

In [19]:
df.head(3)

    id movie_name
0  101   Bahubali
1  102    Chappie
2  103      Judwa

In [22]:
# df[df['id'] > 105]
df[df['id'] == 105]

    id movie_name
4  105     Fukrey

In [25]:
# Slicing Data
df[2:4]

    id movie_name
2  103      Judwa
3  104    Golmaal